perf/bbox/bbox.yaml
config:
  environments:
    bbox9090:
      target: 'http://localhost:9090/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox-9090"
    bbox9091:
      target: 'http://localhost:9091/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox-9091"

  http:
    pool: 50

  phases:
     - name: Cleanup
       duration: 30
       arrivalRate: 0
     - name: Ramp
       duration: 60
       arrivalRate: 0
       rampTo: 15
     - name: Cleanup
       duration: 60
       arrivalRate: 0

scenarios:
  - name: root
    flow:
      - get:
          url: '/'